/*
Алгоритмы сортировок: 
1. Пузырьковая.
По очереди сравниваются соседние элементы, 
если элемент с большим индексом меньше элемента с меньшим индексом,
элементы меняются местами. Процедура повторяется, пока элементы, 
которые нужно поменять местами.
2. Сортировка вставками.
Массив разделятся на две части: отсортированную и неотсортированную,
берется элемент из неотсортированной части и перемещается в отсортированную часть, 
положение элемента определяется путем поочередного сравнения 
с элементами в отсортированной части. 
Процедура выполняется, пока неотсортированная часть не будет пуста.
3. Быстрая сортировка.
Выбирается опорный элемент (например, первый или последний). 
Все элементы больше опорного перемещаются в часть справа от него, 
элементы равные или меньше остаются слева от него.
Далее рекурсивно сортировка применяется к левой и правой части.
4. Сортировка слиянием.

*/
